"use strict";
class City {
    constructor(name, main_text, modal_text, img_path, map_code) {
        this.name = name;
        this.main_text = main_text;
        this.modal_text = modal_text;
        this.img_path = img_path;
        this.map_code = map_code;
    }
}
const sofia = new City(
    "София",
    "София е столицата и най-големият град на България, с богата история и култура. Тя е разположена в централната част на Западна България, заобиколена от пет планини и пресечена от река Искър. София е известна със своите минерални извори, археологически паметници, университети, музеи, театри и киносалони. София е също така важен административен, индустриален, транспортен и образователен център на страната.",
    `Градът е основан през 5-ти век пр.н.е. от тракийското племе Сердика. Той е разположен в западната част на България, заобиколен от планини и хълмове. София е един от много столиците в света, която има горещи минерални извори в градските си граници. Ето някои интересни факти за София:
    • Най-старата сграда в София е малката църква “Свети Георги”, части от коя са построени от римляните като обществена баня.
    • София е била превърната в главен град на България през 1879 г.
    • В София има много музеи, включително Национален музей на историята, Национален музей на природонауката, Национален художествен музей и музей на социалистическото изкуство.
    • София е дом на много културни събития, включително международния фестивал на книгата, международния фестивал на филма и международния фестивал на музиката.`,
    "images/sofia.jpg",
    [42.69684, 23.31964]
);
const krakow = new City(
    "Краков",
    "Краков е вторият по големина и един от най-старите градове в Полша, ситуиран на река Висла. Той е бил столица на Полша от 1038 до 1596 година и е център на полската култура, наука, изкуство и образование. Краков е известен със своето архитектурно и историческо наследство, което е включено в Списъка на световното културно и природно наследство на ЮНЕСКО. Краков е също така популярна туристическа дестинация, привличаща милиони посетители всяка година.",
    `Краков е град в Южна Полша, който е известен със своята богата история и красива архитектура. Ето някои интересни факти за Краков:
    • Старият град на Краков е обявен за първия обект на световното културно наследство на ЮНЕСКО в Полша.
    • Името на Краков традиционно произхожда от Кракус, легендарният основател на Краков и управител на племето на Лехитианите.
    • Университетът на Краков е основан през 1364 г. и е вторият най-стар университет в Централна Европа.
    • Площадът на Краков е най-големият средновековен комерсиален площад в Европа.`,
    "images/krakow.jpg",
    [50.06149, 19.93570]
);
const subotica = new City(
    "Суботица",
    "Суботица е град в Северна Сърбия, разположен на около 10 км от границата с Унгария. Той е административен център на Северобачки окръг и има население от около 100 000 души. Суботица е известна със своята разнообразна и богата култура, която отразява влиянието на различни народи и религии, които са живели в града през вековете. Суботица е също така важен икономически, образователен и туристически център в региона.",
    `Градът е известен с множество културни и исторически забележителности, като например:
    • Суботичка синагога - една от най-големите синагоги в Европа, която е построена през 1902 г. и е дом на музей за еврейската култура;
    • Градски музей - музей, който представя историята на Суботица и региона;
    • Паличко езеро - едно от най-хубавите езера в Сърбия, което е разположено в околностите на града. То е известно със своите термални извори и красивата природа;
    • Ратушата на Суботица - красива сграда, която е построена през 1910 г. и е един от символите на града.`,
    "images/subotica.jpg",
    [46.1006, 19.6638]
);
